{"sections":{"main":{"type":"page","settings":{}},"16600491776f8efa07":{"type":"component-faq","blocks":{"1660049177d929d401-0":{"type":"question","settings":{"title":"Does Red Light Therapy Work?","text":"<p>Absolutely! RLT has an extensive track record of effectiveness. Thousands of studies have shown that this drug-free and natural process is beneficial. RLT can treat a wide range of issues including but not limited to, skin conditions, arthritis, inflammation, dementia, tendonitis, hair loss, dental pain, and osteoarthritis. When combined with exercise and a healthy diet, Red Light Therapy is a rousing success.<\/p>"}},"1660049177d929d401-1":{"type":"question","settings":{"title":"Is It Safe?","text":"<p>There have been over 5,000 research papers published on Red Light Therapy. There have been no reports of adverse effects of any kind due to RLT. That alone speaks to the efficacy of RLT. The FDA has approved and green-lit our products. Our lamps are effective in treating arthritis, joint pain, muscle pain, acne, compromised blood circulation, and reversing hair loss.<\/p>"}},"ecfabd51-9765-4bba-af34-73eaafa00ad9":{"type":"question","settings":{"title":"How Do I Use My Red Light?","text":"<p>There are many ways to use our lamps at your home. Your treatment can be delivered sitting, lying down, or standing. It’s up to you. Your lamp can be hung above you, placed standing on a table or the floor, or positioned on your bed so you can relax while experiencing the benefits of our lamps.<\/p>"}},"b4a761b7-e029-4323-876f-74e0721b4001":{"type":"question","settings":{"title":"How Often Should I Use My Lamp?","text":"<p>According to studies, utilizing Red Light Therapy three to seven times a week is when it is most effective. Once you begin to see significant improvements, you can scale back how often you use the treatment.<\/p>"}},"edbd428c-01ca-437e-8eee-c0cf0d5701cb":{"type":"question","settings":{"title":"When Should I Do My Treatment?","text":"<p>The top two considerations are right after you wake up or in the evening before you go to sleep. Studies have shown that there are great benefits to using RLT in the morning can provide a surge of energy to aid you during the day. On the other side, using RLT in the evening has shown a significant chance of improving sleep patterns. The choice is up to you!<\/p>"}},"4a018d49-2833-4f48-af48-b126dc1baaa4":{"type":"question","settings":{"title":"What Wavelength Are LumiRed Lamps?","text":"<p>We offer a 50\/50 ratio of 660nm red light and 850nm near-infrared light. Through extensive testing and studies, we found this combination to provide the best results. Our lamps are fitted with switches so you can use either wavelength. If you want to use both, you’re able to do that as well.<\/p>"}},"21991b59-b9cb-43ed-a80e-9132ed9add17":{"type":"question","settings":{"title":"Do I Need To Cover My Eyes?","text":"<p>It’s not damaging to the eyes, but we do recommend wearing protection, which we provide!<\/p>"}},"b1ae50da-f6e1-44c0-b84c-13d82da20f58":{"type":"question","settings":{"title":"Can I Return My Device If I Am Not Happy?","text":"<p>We are confident that you will love your Red Light Therapy lamp, but we also understand that at the end of the day, you might not be getting what you want. As such, we offer a 30-day money-back guarantee.If you have any questions about the product or you’re not impressed, feel free to send us a message. A change in treatment dosage is often all that is needed to see expected benefits. If you’re still not happy after this, we will refund you!The product must still be in ‘as new’ condition and not have endured any damage to the unit. You should have all accessories and original packaging. You will be required to pay the shipping to send the product back to us.<\/p>"}},"6c01deaf-3203-4c6d-97ab-ba75d2703b1e":{"type":"question","settings":{"title":"Why Are Your Products Cheaper Than Competitor Brands?","text":"<p>We are able to do this because we run an efficient organization with limited marketing and overhead’s. We don’t pay for celebrity endorsements and multiple affiliates. We keep our costs and overhead’s low in order to pass the savings on to you so you get the highest quality device at the best possible price.<\/p>"}},"b666939b-a1e4-4bdb-b4e8-dc27f47ba296":{"type":"question","settings":{"title":"Do You Provide Advice And Support?","text":"<p>Absolutely! Your success with Red Light Therapy is our top priority. Our qualified health professionals are available to provide guidance on everything from what device to choose, treatment for specific conditions to maximising benefit from your session. Schedule a call with us <a href=\"\/pages\/contact\" title=\"Contact\">HERE<\/a> and we will be glad to chat and help.<\/p>"}}},"block_order":["1660049177d929d401-0","1660049177d929d401-1","ecfabd51-9765-4bba-af34-73eaafa00ad9","b4a761b7-e029-4323-876f-74e0721b4001","edbd428c-01ca-437e-8eee-c0cf0d5701cb","4a018d49-2833-4f48-af48-b126dc1baaa4","21991b59-b9cb-43ed-a80e-9132ed9add17","b1ae50da-f6e1-44c0-b84c-13d82da20f58","6c01deaf-3203-4c6d-97ab-ba75d2703b1e","b666939b-a1e4-4bdb-b4e8-dc27f47ba296"],"settings":{"title":"General","padding_block":0}},"1660125345a0b4559b":{"type":"component-faq","blocks":{"1660125345936f446c-0":{"type":"question","settings":{"title":"When should I do my treatment?","text":"<p>This is another question that many tend to ask a lot. In truth, there are some significant benefits attached if you conduct the treatment in the morning and before you go to bed.<\/p><p>Some studies have shown that applying red light therapy in the evening has a significant chance of improving your sleep patterns. At the same time, using it in the morning could provide you with a jolt of energy for the days ahead.<\/p><p>So, these are the two top considerations for you – in the morning or the evening. Ideally, the recommendation will be to give both a try and to see which will work better for your body.<\/p>"}},"1660125345936f446c-1":{"type":"question","settings":{"title":"Do I need to cover my eyes?","text":"<p>The lights are bright! While not damaging to the eyes, we recommend you wear some eye protection if staring directly at the light. We have provided eye protectors for you.<\/p>"}},"18ceaa1b-dd27-49ce-bf4d-92773e6fcc5b":{"type":"question","settings":{"title":"How long does it take to start seeing results?","text":"<p>For most people, they’ll start seeing some difference in energy almost immediately; their skin “glow” becomes more noticeable. For dramatic effects, you have to use it for eight weeks consistently.<\/p><p>For joint pains and muscle soreness, you may start seeing result right away. For others, it could take as much as 8 hrs after use for the full effects to come to play.<\/p><p>For a more systemic whole-body wellness—like growing your muscles during strength training—it can take several weeks to see full effects. For best results, we recommend using it 3-7 times a week.<\/p>"}},"f0bed150-5541-48e8-8521-ce07a4281d18":{"type":"question","settings":{"title":"Does too much red light have any adverse effects?","text":"<p>If you apply too much of red light, you’re adding more stress to your cells—and that may be counterproductive. Stick to less than 10-15 mins per area per day to be in the safe zone. Going beyond that limit takes away the positive effects.<\/p>"}},"3052ab34-2a41-4221-a0b9-bcc0490c3b73":{"type":"question","settings":{"title":"Can Red Light Therapy induce detoxification?","text":"<p>If you have been unwell or suffering from symptoms for some time, your body will most likely start to detox with Red Light Therapy. This is a good thing, but it is essential that it is controlled and happens slowly. This is why we recommend you start at half the recommended dosage and gradually build it up over a few weeks. Being tired after treatment is a classic sign of a detox reaction. Hydration is essential for your treatment.<\/p>"}},"18d0fe58-aa13-468d-88ef-869d91194375":{"type":"question","settings":{"title":"How do I use my Red Light lamp?","text":"<p>Our lamps are light and mobile. You can deliver your treatment in standing, sitting or lying down. You can hang your lamp, place it standing on a table or the floor or even position it on your bed while you lie down and relax.<\/p><p>Our Pro models come with hooks to hang them over any door.<\/p>"}},"004b165f-6c34-41f4-88c7-c88b061d6f03":{"type":"question","settings":{"title":"Can I use Red Light Therapy if I am pregnant?","text":"<p>There has been no clinical research with red light therapy treatments on pregnant or nursing subjects. Do not use the device if pregnant or lactating before consulting with your healthcare provider.<\/p>"}}},"block_order":["1660125345936f446c-0","1660125345936f446c-1","18ceaa1b-dd27-49ce-bf4d-92773e6fcc5b","f0bed150-5541-48e8-8521-ce07a4281d18","3052ab34-2a41-4221-a0b9-bcc0490c3b73","18d0fe58-aa13-468d-88ef-869d91194375","004b165f-6c34-41f4-88c7-c88b061d6f03"],"settings":{"title":"TREATMENT","padding_block":60}},"166013002687c09b86":{"type":"component-faq","blocks":{"1660130026bf27d7d6-0":{"type":"question","settings":{"title":"When will my order be shipped?","text":"<p>All our products are shipped from our Irish warehouse and will be dispatched within one working day after order confirmation. We use DPD Couriers which provide next day delivery within Ireland. Your tracking number will be sent by email as soon as your order has been dispatched.<\/p>"}},"1660130026bf27d7d6-1":{"type":"question","settings":{"title":"What is the cost of shipping?","text":"<p>All orders to Ireland are shipped free of charge. Check the list of countries we also ship to <a href=\"\/pages\/delivery-returns\" title=\"Delivery & Returns\">HERE<\/a>.<\/p>"}},"7d162d9d-c07d-46eb-bdc9-8a7d594919b6":{"type":"question","settings":{"title":"Are there any additional fees?","text":"<p>No. Unlike many suppliers who ship from the US and Asia, all our products are shipped directly from our Irish warehouse so will incur no customs charges.<\/p>"}},"64578245-7edc-4c63-a100-d1356fd8eef0":{"type":"question","settings":{"title":"What are your payment methods?","text":"<p>We accept all major credit cards, which are processed through our provider Shopify Payments for maximum security for your transaction. We also accept PayPal and Klarna<\/p>"}},"b9ba792b-8b6e-4b4f-a37e-3345024ffefa":{"type":"question","settings":{"title":"Can I return my device if I am not happy with it?","text":"<p>At LumiRed, we do not doubt that you’ll love your red light therapy device. However, we also understand that you might not like what you get at the end of the day. This is why we have provided a 30-day money-back guarantee.<br\/><br\/>So, if you have any question about the product or you’re not impressed, feel free to send us a message. Often, a change in treatment dosage is all that is required if you do not see the benefit. If you are still not happy, we will refund you.<br\/><br\/>Note, however, that the product will have to be in ‘as new’ condition. There must be no damage to the unit, and all accessories must be intact. Also, keep in mind that you will have to pay the shipping fees to send the product back to us.<\/p>"}},"3f758bb3-90bd-44b5-a288-6a793d0d083c":{"type":"question","settings":{"title":"What is your warranty?","text":"<p>We take great pride in our manufacturing processes. Our Original Series has a lifespan of 50,000 hours, and our Pro-Series has 100,000 hours. For many, this is much more than a single lifetime of use.<br\/><br\/>However, we have also backed each device by a 3-year warranty that covers all internal issues. Note that we don’t cover any damage related to external problems or misuse.<\/p>"}}},"block_order":["1660130026bf27d7d6-0","1660130026bf27d7d6-1","7d162d9d-c07d-46eb-bdc9-8a7d594919b6","64578245-7edc-4c63-a100-d1356fd8eef0","b9ba792b-8b6e-4b4f-a37e-3345024ffefa","3f758bb3-90bd-44b5-a288-6a793d0d083c"],"settings":{"title":"ORDERS & RETURNS","padding_block":0}}},"order":["main","16600491776f8efa07","1660125345a0b4559b","166013002687c09b86"]}